
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        2 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                           |
|:--------:|:------------------------------------|
|    🟢    | `aws_iam_policy.ha-permissions`     |
|    🟢    | `aws_iam_user_policy_attachment.ha` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.ha-permissions will be created
  + resource "aws_iam_policy" "ha-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for Home Assistant"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ha-permissions-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/Z06678433LQB8HDM1I8R"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # aws_iam_user_policy_attachment.ha will be created
  + resource "aws_iam_user_policy_attachment" "ha" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "home-assitant"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>